// 1. Три різних числа вводяться через prompt().
//     За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)
//
// 2.
// Все параматры получаем с клавиатуры!!!!
//     Имитируем поведение пешехода на перекстке.
//     Если светофор зеленый - вывести "иди".
//     Если светофор желтый - вывести "подожди".
//     Если светофор красный - вывести "стой".
//     Если светофор в аварийном режиме вывести "делай что хочешь"!
//
//     3
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
//     Улучшаем предыдущее задание.
//     Если светофор зеленый и машин нет - вывести "иди".
//     Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
//     Если светофор желтый и машин нет - вывести "все рано жди".
//     Если светофор красный и машин нет- вывести "стой все рано".
//     Если светофор красный - и машины есть вывести "стой и жди".
//     Если светофор в аварийном режиме вывести "делай что хочешь"!

// let color=prompt('color?')
// if (color==='green'){
//     alert('go')
// }else if (color==='yellow'){
//     alert("stay 1sec")
// }else if (color==='red'){
//     alert('stop')
// }else  {
//     alert('????????')
// }

// color = prompt('Color');
// IsRoadClear = confirm("Car");
// if (color === 'green' && !IsRoadClear) {
//     alert('Go!')
// } else if (color === 'green' && IsRoadClear)
//     alert("Wait until the violators pass!")
// else if (color === 'yellow' && IsRoadClear) {
//     alert('Wait!')
// } else if (color === 'yellow' && !IsRoadClear) {
//     alert('Wait anyway!')
// } else if (color === 'red' && !IsRoadClear) {
//     alert('Stay anyway!')
// } else if (color === 'red' && IsRoadClear) {
//     alert('Stay and wait!')
// } else if (color === 'error') {
//     alert('Do what you want!')
// }


// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// let mass=[2,17,13,6,22,31,45,66,100,-18];
// let i=0;
// while(i<=mass.length){
//     const mas=mass[i];
//     i++;
//     console.log(mas);
// }

//     1. перебрати його циклом while
//     2. перебрати його циклом for
// for (let i = 0; i < mass.length; i++) {
//     const mass1 = mass[i];
//     console.log(mass1);
// }
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i=0;
// while(i<=mass.length){
//     const mas=mass[i];
//     i++;
//     if (mas%2===0){
//     console.log(mas);
// }}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < mass.length; i++) {
//     const mass1 = mass[i];
//     if (mass1%2!==0){
//         console.log(mass1)
//     }
// }
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// let i=0;
// while(i<=mass.length){
//     let mas=mass[i];
//     i++;
//     if (mas%3===0){
//         mas='okten';
//     }
// console.log(mas)}
// 8. вивести масив в зворотньому порядку.
// let mass=[2,17,13,6,22,31,45,66,100,-18];
// for(let i=mass.length;i>=0;i--){
//     const mas=mass[i];
//     console.log(mas);
// }
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.

// for (let i = 0; i < 50; i++) {
//     let arrayElement = [i];
//     if (i%2===0){
//     console.log(arrayElement);
// }}
//
//
// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//
//
//
//
//     ______________________________________________________________________________________________________________________________________________________
// Додатково
// ______________________________________________________________________________________________________________________________________________________
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
let array=[ 'a', 'b', 'c']
for (let i = 0; i < array.length; i++) {
    const arrayElement =+ array[i];
    console.log(arrayElement)
}
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.